###############################################################################
# Created by write_sdc
###############################################################################
current_design multiply_add
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {constant[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {constant[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {constant[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {constant[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {constant[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {constant[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {constant[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {constant[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {nrst}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {o[16]}]
set_load -pin_load 0.0334 [get_ports {o[15]}]
set_load -pin_load 0.0334 [get_ports {o[14]}]
set_load -pin_load 0.0334 [get_ports {o[13]}]
set_load -pin_load 0.0334 [get_ports {o[12]}]
set_load -pin_load 0.0334 [get_ports {o[11]}]
set_load -pin_load 0.0334 [get_ports {o[10]}]
set_load -pin_load 0.0334 [get_ports {o[9]}]
set_load -pin_load 0.0334 [get_ports {o[8]}]
set_load -pin_load 0.0334 [get_ports {o[7]}]
set_load -pin_load 0.0334 [get_ports {o[6]}]
set_load -pin_load 0.0334 [get_ports {o[5]}]
set_load -pin_load 0.0334 [get_ports {o[4]}]
set_load -pin_load 0.0334 [get_ports {o[3]}]
set_load -pin_load 0.0334 [get_ports {o[2]}]
set_load -pin_load 0.0334 [get_ports {o[1]}]
set_load -pin_load 0.0334 [get_ports {o[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {nrst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {constant[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {constant[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {constant[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {constant[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {constant[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {constant[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {constant[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {constant[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
